import numpy as np


def task_1():
    """
    Дан массив 7x7 найти сумму всех отрицательных нечётных элементов
    :return:
    """
    matrix = np.array([
        [1, 2, 3, -4, 5, 6, 7],
        [1, 2, 3, 4, 5, 6, 7],
        [1, 2, -3, 4, 5, 6, 7],
        [1, 2, 3, 4, 5, 6, 7],
        [1, -2, 3, 4, 5, 6, 7],
        [1, 2, 3, 4, 5, -6, 7],
        [1, 2, 3, 4, -5, 6, 7],
    ])

    vec = matrix.reshape(7 * 7, )
    vec = vec[vec < 0]
    print(np.sum(vec[1 == vec % 2]))


def task_2():
    """
    найти произведение всех элементов первой строки
    :return:
    """
    matrix = np.array([
        [1, 2, 3],
        [1, 2, 3],
        [1, 2, 3],
    ])
    print(matrix[0, :].prod())


task_2()
